In [1]:
# python dictionaty
people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schefer", "Doe", "Doe"],
    "email": ["email1", "email2", "email3"]
}
import pandas as pd
df = pd.DataFrame(people)
df

   first     last   email
0  Corey  Schefer  email1
1   Jane      Doe  email2
2   John      Doe  email3

In [2]:
# adding columns: create a column and pass in a series of values
df['first'] + ' ' + df['last']

0    Corey Schefer
1         Jane Doe
2         John Doe
dtype: object

In [3]:
df['full_name'] = df['first'] + ' ' + df['last']
df

   first     last   email      full_name
0  Corey  Schefer  email1  Corey Schefer
1   Jane      Doe  email2       Jane Doe
2   John      Doe  email3       John Doe

In [5]:
# removing columns: drop method
df.drop(columns=['first', 'last'], inplace=True)
df

    email      full_name
0  email1  Corey Schefer
1  email2       Jane Doe
2  email3       John Doe

In [6]:
# split full name column into two different columns
df['full_name'].str.split(' ')

0    [Corey, Schefer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [8]:
# expand argument
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schefer
1   Jane      Doe
2   John      Doe

In [9]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
df

    email      full_name  first     last
0  email1  Corey Schefer  Corey  Schefer
1  email2       Jane Doe   Jane      Doe
2  email3       John Doe   John      Doe

In [10]:
# append method: adding a single row of data
df.append({'first': 'Tony'}, ignore_index=True)

    email      full_name  first     last
0  email1  Corey Schefer  Corey  Schefer
1  email2       Jane Doe   Jane      Doe
2  email3       John Doe   John      Doe
3     NaN            NaN   Tony      NaN

In [12]:
people = {
    "first": ["Tony", "Steve"],
    "last": ["Stark", "Rogers"],
    "email": ["email4", "email5"]
}
df2 = pd.DataFrame(people)
df2

   first    last   email
0   Tony   Stark  email4
1  Steve  Rogers  email5

In [14]:
# append the one dataframe to the other 
# (with conflicting indexes and columns that are not in the same order)
df.append(df2, ignore_index=True, sort=False)

    email      full_name  first     last
0  email1  Corey Schefer  Corey  Schefer
1  email2       Jane Doe   Jane      Doe
2  email3       John Doe   John      Doe
3  email4            NaN   Tony    Stark
4  email5            NaN  Steve   Rogers

In [15]:
df = df.append(df2, ignore_index=True, sort=False)
df

    email      full_name  first     last
0  email1  Corey Schefer  Corey  Schefer
1  email2       Jane Doe   Jane      Doe
2  email3       John Doe   John      Doe
3  email4            NaN   Tony    Stark
4  email5            NaN  Steve   Rogers

In [16]:
# removing rows
df.drop(index=4)

    email      full_name  first     last
0  email1  Corey Schefer  Corey  Schefer
1  email2       Jane Doe   Jane      Doe
2  email3       John Doe   John      Doe
3  email4            NaN   Tony    Stark

In [18]:
# drop by conditional
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

    email      full_name  first     last
0  email1  Corey Schefer  Corey  Schefer
3  email4            NaN   Tony    Stark
4  email5            NaN  Steve   Rogers